/* 
   * (🐺) Exercicio 1001 - Beecrowd - "Extremamente Básico"
*/

// Inclusão de Arquivo(s) e Biblioteca(s)
#include <stdio.h>

int main()
{
   // Varáveis
   int A, B, X;

   // Entrada de Dados
   scanf("%d", &A);
   scanf("%d", &B);

   // Realizando Cálculo
   X = A + B;
   
   // Imprimindo Resultado
   printf("X = %d\n", X);

   return 0;
}

// ————————————————————————————————————————————————————————————————————————————— //
// ----------------------------------------------------------------------------- //
// --------------------- Código escrito por [Igor Rampazo] --------------------- //
// ------------------- GitHub:https://github.com/IgorRampazo ------------------- //
// ----------------------------------------------------------------------------- //
// ————————————————————————————————————————————————————————————————————————————— //