/* 
   * (🐺) Exercicio 1002 - Beecrowd - "Área do Círculo"
*/

// Inclusão de Arquivo(s) e Biblioteca(s)
#include <stdio.h>

int main()
{
   // Variáveis
   double raio, n = 3.14159, area;

   // Entrada de Dados
   scanf("%lf", &raio);

   // Cálculo da área do Círculo
   area = n * (raio * raio);

   // Imprimindo Resultado
   printf("A=%.4lf\n", area);

   return 0;
}

// ————————————————————————————————————————————————————————————————————————————— //
// ----------------------------------------------------------------------------- //
// --------------------- Código escrito por [Igor Rampazo] --------------------- //
// ------------------- GitHub:https://github.com/IgorRampazo ------------------- //
// ----------------------------------------------------------------------------- //
// ————————————————————————————————————————————————————————————————————————————— //