/* 
   * (🐺) Exercicio 1003 - Beecrowd - "Soma Simples"
*/

// Inclusão de Arquivo(s) e Biblioteca(s)
#include <stdio.h>

int main()
{
   // Variáveis
   int A, B, SOMA;

   // Entrada de Dados
   scanf("%d", &A);
   scanf("%d", &B);

   // Calculando a soma
   SOMA = A + B;

   // Imprimindo Resultado
   printf("SOMA = %d", SOMA);

   return 0;
}

// ————————————————————————————————————————————————————————————————————————————— //
// ----------------------------------------------------------------------------- //
// --------------------- Código escrito por [Igor Rampazo] --------------------- //
// ------------------- GitHub:https://github.com/IgorRampazo ------------------- //
// ----------------------------------------------------------------------------- //
// ————————————————————————————————————————————————————————————————————————————— //