/* 
   * (🐺) Exercicio 1004 - Beecrowd - "Produto Simples"
*/

// Inclusão de Arquivo(s) e Biblioteca(s)
#include <stdio.h>

int main()
{
   // Variáveis
   int a, b, PROD;

   // Entrada de Dados
   scanf("%d", &a);
   scanf("%d", &b);

   // Produto Simples
   PROD = a * b;

   // Imprimindo Resultado
   printf("PROD = %d\n", PROD);
   
   return 0;
}

// ————————————————————————————————————————————————————————————————————————————— //
// ----------------------------------------------------------------------------- //
// --------------------- Código escrito por [Igor Rampazo] --------------------- //
// ------------------- GitHub:https://github.com/IgorRampazo ------------------- //
// ----------------------------------------------------------------------------- //
// ————————————————————————————————————————————————————————————————————————————— //