/* 
   * (🐺) Exercicio 1005 - Beecrowd - "Média 1"
*/

// Inclusão de Arquivo(s) e Biblioteca(s)
#include <stdio.h>

int main()
{
   // Variáveis
   float a, b, MED;

   // Entrada de Dados
   scanf("%f", &a);
   scanf("%f", &b);

   // Média
   MED = ((a * 3.5) + (b * 7.5)) / (3.5 + 7.5);

   // Imprimindo Resultado
   printf("MEDIA = %.5f\n", MED);
   
   return 0;
}

// ————————————————————————————————————————————————————————————————————————————— //
// ----------------------------------------------------------------------------- //
// --------------------- Código escrito por [Igor Rampazo] --------------------- //
// ------------------- GitHub:https://github.com/IgorRampazo ------------------- //
// ----------------------------------------------------------------------------- //
// ————————————————————————————————————————————————————————————————————————————— //