/* 
   * (🐺) Exercicio 1006 - Beecrowd - "Média 2"
*/

// Inclusão de Arquivo(s) e Biblioteca(s)
#include <stdio.h>

int main()
{
   // Variáveis
   float a, b, c, MED;

   // Entrada de Dados
   scanf("%f", &a);
   scanf("%f", &b);
   scanf("%f", &c);

   // Média
   MED = ((a * 2) + (b * 3) + (c * 5)) / (2 + 3 + 5);

   // Imprimindo Resultado
   printf("MEDIA = %.1f\n", MED);
   
   return 0;
}

// ————————————————————————————————————————————————————————————————————————————— //
// ----------------------------------------------------------------------------- //
// --------------------- Código escrito por [Igor Rampazo] --------------------- //
// ------------------- GitHub:https://github.com/IgorRampazo ------------------- //
// ----------------------------------------------------------------------------- //
// ————————————————————————————————————————————————————————————————————————————— //