/* 
   * (🐺) Exercicio 1007 - Beecrowd - "Diferença"
*/

// Inclusão de Arquivo(s) e Biblioteca(s)
#include <stdio.h>

int main()
{
   // Variáveis
   int a, b, c, d, DIF;

   // Entrada de Dados
   scanf("%d", &a);
   scanf("%d", &b);
   scanf("%d", &c);
   scanf("%d", &d);

   // Diferença
   DIF = ((a * b) - (c * d));

   // Imprimindo Resultado
   printf("DIFERENCA = %d\n", DIF);
   
   return 0;
}

// ————————————————————————————————————————————————————————————————————————————— //
// ----------------------------------------------------------------------------- //
// --------------------- Código escrito por [Igor Rampazo] --------------------- //
// ------------------- GitHub:https://github.com/IgorRampazo ------------------- //
// ----------------------------------------------------------------------------- //
// ————————————————————————————————————————————————————————————————————————————— //