""" 
   * (🐺) Exercicio 1001 - Beecrowd - "Extremamente Básico"
"""

# Recebendo argumentos
A = int(input())
B = int(input())

# Soma de A + B
X = A + B

# Imprimindo Resultado
print(f"X = {X}")

# ————————————————————————————————————————————————————————————————————————————— #
#                                                                               #
# --------------------- Código escrito por [Igor Rampazo] --------------------- #
# ------------------- GitHub:https://github.com/IgorRampazo ------------------- #
#                                                                               #
# ————————————————————————————————————————————————————————————————————————————— #