""" 
   * (🐺) Exercicio 1002 - Beecrowd - "Área do Círculo"
"""

# Valor de PI
n = 3.14159

# Recebendo o valor do Raio
raio = float(input())

# Calculando a Área do Círculo
A = n * (raio ** 2)

# Imprimindo Resultado
print(f"A={A:.4f}")

# ————————————————————————————————————————————————————————————————————————————— #
#                                                                               #
# --------------------- Código escrito por [Igor Rampazo] --------------------- #
# ------------------- GitHub:https://github.com/IgorRampazo ------------------- #
#                                                                               #
# ————————————————————————————————————————————————————————————————————————————— #