""" 
   * (🐺) Exercicio 1003 - Beecrowd - "Soma Simples"
"""

# Recebendo Valores
A = int(input())
B = int(input())

# Realizando Soma
SOMA = A + B

# Imprimindo Resultado
print(f"SOMA = {SOMA}")

# ————————————————————————————————————————————————————————————————————————————— #
#                                                                               #
# --------------------- Código escrito por [Igor Rampazo] --------------------- #
# ------------------- GitHub:https://github.com/IgorRampazo ------------------- #
#                                                                               #
# ————————————————————————————————————————————————————————————————————————————— #