""" 
   * (🐺) Exercicio 1004 - Beecrowd - "Produto Simples"
"""

# Recebendo Valores
num1 = int(input())
num2 = int(input())

# Realizando Produto
PROD = num1 * num2

# Imprimindo Resultado
print(f"PROD = {PROD}")

# ————————————————————————————————————————————————————————————————————————————— #
#                                                                               #
# --------------------- Código escrito por [Igor Rampazo] --------------------- #
# ------------------- GitHub:https://github.com/IgorRampazo ------------------- #
#                                                                               #
# ————————————————————————————————————————————————————————————————————————————— #