""" 
   * (🐺) Exercicio 1005 - Beecrowd - "Média 1"
"""

# Recebendo Valores
A = float(input())
B = float(input())

# Realizando Média Ponderada
MEDIA = (A * 3.5 + B * 7.5) / (3.5 + 7.5)

# Imprimindo Resultado
print(f"MEDIA = {MEDIA:.5f}")

# ————————————————————————————————————————————————————————————————————————————— #
#                                                                               #
# --------------------- Código escrito por [Igor Rampazo] --------------------- #
# ------------------- GitHub:https://github.com/IgorRampazo ------------------- #
#                                                                               #
# ————————————————————————————————————————————————————————————————————————————— #