""" 
   * (🐺) Exercicio 1006 - Beecrowd - "Média 2"
"""

# Recebendo Valores
A = float(input())
B = float(input())
C = float(input())

# Realizando Média Ponderada
MEDIA = (A * 2 + B * 3 + C * 5) / (2 + 3 + 5)

# Imprimindo Resultado
print(f"MEDIA = {MEDIA:.1f}")

# ————————————————————————————————————————————————————————————————————————————— #
#                                                                               #
# --------------------- Código escrito por [Igor Rampazo] --------------------- #
# ------------------- GitHub:https://github.com/IgorRampazo ------------------- #
#                                                                               #
# ————————————————————————————————————————————————————————————————————————————— #