""" 
   * (🐺) Exercicio 1007 - Beecrowd - "Diferença"
"""

# Recebendo Valores
A = int(input())
B = int(input())
C = int(input())
D = int(input())

# Realizando o Cálculo de Diferença
DIF = (A * B - C * D)

# Imprimindo Resultado
print(f"DIFERENCA = {DIF}")

# ————————————————————————————————————————————————————————————————————————————— #
#                                                                               #
# --------------------- Código escrito por [Igor Rampazo] --------------------- #
# ------------------- GitHub:https://github.com/IgorRampazo ------------------- #
#                                                                               #
# ————————————————————————————————————————————————————————————————————————————— #