""" 
   * (🐺) Exercicio 1008 - Beecrowd - "Salário"
"""

# Recebendo Valores
cod = int(input())
hrs = int(input())
slh = float(input())

# Realizando o Cálculo do Salário
salario = float(slh * hrs)

# Imprimindo Resultado
print(f"NUMBER = {cod}")
print(f"SALARY = U$ {salario:.2f}")

# ————————————————————————————————————————————————————————————————————————————— #
#                                                                               #
# --------------------- Código escrito por [Igor Rampazo] --------------------- #
# ------------------- GitHub:https://github.com/IgorRampazo ------------------- #
#                                                                               #
# ————————————————————————————————————————————————————————————————————————————— #