""" 
   * (🐺) Exercicio 1009 - Beecrowd - "Salário com Bônus"
"""

# Recebendo Valores
nome = str(input())
salr = float(input())
tved = float(input())

# Realizando o Cálculo do Salário + Bônus
salario_final = float((tved * 0.15) + salr)

# Imprimindo Resultado
print(f"TOTAL = R$ {salario_final:.2f}")

# ————————————————————————————————————————————————————————————————————————————— #
#                                                                               #
# --------------------- Código escrito por [Igor Rampazo] --------------------- #
# ------------------- GitHub:https://github.com/IgorRampazo ------------------- #
#                                                                               #
# ————————————————————————————————————————————————————————————————————————————— #