""" 
   * (🐺) Exercicio 1011 - Beecrowd - "Esfera"
"""

# Recebendo Valores
R = float(input())
PI = 3.14159

# Realizando o Cálculo do Volume da Esfera
volume = (4/3) * PI * (R**3)

# Imprimindo Resultado
print(f"VOLUME = {volume:.3f}")

# ————————————————————————————————————————————————————————————————————————————— #
#                                                                               #
# --------------------- Código escrito por [Igor Rampazo] --------------------- #
# ------------------- GitHub:https://github.com/IgorRampazo ------------------- #
#                                                                               #
# ————————————————————————————————————————————————————————————————————————————— #