<?php

/* 
   * (🐺) Exercicio 1000 - Beecrowd - "Hello World!"
*/

# Imprimindo argumento
echo 'Hello World!' . PHP_EOL;

# ————————————————————————————————————————————————————————————————————————————— #
#                                                                               #
# --------------------- Código escrito por [Igor Rampazo] --------------------- #
# ------------------- GitHub:https://github.com/IgorRampazo ------------------- #
#                                                                               #
# ————————————————————————————————————————————————————————————————————————————— #

?>
