<?php

/* 
   * (🐺) Exercicio 1001 - Beecrowd - "Extremamente Básico"
*/

# Recebendo valores
$A = trim(fgets(STDIN));
$B = trim(fgets(STDIN));

# Calculando soma
$X = $A + $B;

# Imprimindo argumento
echo "X = $X" . PHP_EOL;

# ————————————————————————————————————————————————————————————————————————————— #
#                                                                               #
# --------------------- Código escrito por [Igor Rampazo] --------------------- #
# ------------------- GitHub:https://github.com/IgorRampazo ------------------- #
#                                                                               #
# ————————————————————————————————————————————————————————————————————————————— #

?>