<?php

/* 
   * (🐺) Exercicio 1002 - Beecrowd - "Área do Círculo"
*/

# Recebendo valores
$n = 3.14159;
$raio = trim(fgets(STDIN));

# Cálculando a Área
$A = $n * ($raio ** 2);

# Imprimindo argumento
printf("A = %.4f\n", $A);

# ————————————————————————————————————————————————————————————————————————————— #
#                                                                               #
# --------------------- Código escrito por [Igor Rampazo] --------------------- #
# ------------------- GitHub:https://github.com/IgorRampazo ------------------- #
#                                                                               #
# ————————————————————————————————————————————————————————————————————————————— #

?>