<?php

/* 
   * (🐺) Exercicio 1003 - Beecrowd - "Soma Simples"
*/

# Recebendo valores
$A = trim(fgets(STDIN));
$B = trim(fgets(STDIN));

# Soma
$SOMA = $A + $B;

# Imprimindo argumento
echo "SOMA = $SOMA" . PHP_EOL;

# ————————————————————————————————————————————————————————————————————————————— #
#                                                                               #
# --------------------- Código escrito por [Igor Rampazo] --------------------- #
# ------------------- GitHub:https://github.com/IgorRampazo ------------------- #
#                                                                               #
# ————————————————————————————————————————————————————————————————————————————— #

?>