<?php

/* 
   * (🐺) Exercicio 1004 - Beecrowd - "Problema Simples"
*/

# Recebendo valores
$A = trim(fgets(STDIN));
$B = trim(fgets(STDIN));

# Soma
$PROD = $A * $B;

# Imprimindo argumento
echo "PROD = $PROD" . PHP_EOL;

# ————————————————————————————————————————————————————————————————————————————— #
#                                                                               #
# --------------------- Código escrito por [Igor Rampazo] --------------------- #
# ------------------- GitHub:https://github.com/IgorRampazo ------------------- #
#                                                                               #
# ————————————————————————————————————————————————————————————————————————————— #

?>