<?php

/* 
   * (🐺) Exercicio 1007 - Beecrowd - "Diferença"
*/

# Recebendo valores
$A = trim(fgets(STDIN));
$B = trim(fgets(STDIN));
$C = trim(fgets(STDIN));
$D = trim(fgets(STDIN));

# Diferença
$DIF = ($A * $B) - ($C * $D);

# Imprimindo argumento
echo "DIFERENCA = $DIF" . PHP_EOL;

# ————————————————————————————————————————————————————————————————————————————— #
#                                                                               #
# --------------------- Código escrito por [Igor Rampazo] --------------------- #
# ------------------- GitHub:https://github.com/IgorRampazo ------------------- #
#                                                                               #
# ————————————————————————————————————————————————————————————————————————————— #

?>