/* 
   * (🐺) Exercicio 2602 - Beecrowd - "Endereço dos Clientes"
*/

-- Selecionando as linhas da coluna 'name', onde o valor da coluna 'state' seja 'RS'
SELECT name, street FROM customers WHERE city = 'Porto Alegre';

/* ————————————————————————————————————————————————————————————————————————————— /*
/* ----------------------------------------------------------------------------- */
/* --------------------- Código escrito por [Igor Rampazo] --------------------- */
/* ------------------- GitHub:https://github.com/IgorRampazo ------------------- */
/* ----------------------------------------------------------------------------- */
/* ————————————————————————————————————————————————————————————————————————————— */